tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
# Python
brew "python"
brew "pyenv"
# Core application library for C
brew "glib"
# Configurable talking characters in ASCII art
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Package for scientific computing with Python
brew "numpy"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql", restart_service: true
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Source-code syntax highlighter
brew "source-highlight"
# Internet file retriever
brew "wget"
brew "jq"
brew "coder-cli"
brew "curl" 



# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logitech-options"
# Open-source code editor
cask "visual-studio-code"
# Spotify
cask "spotify"
cast "postman"
cast "sublime-text"
cast "rectangle" 
cast "zulu15"
cast "obsidian" 

